// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

// 3, 5 -> 243 (3⁵)

// 2, 4 -> 16

Console.Write("Введите число A: ");
int A=Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число B: ");
int B=Convert.ToInt32(Console.ReadLine());
// Construction(A,B);

// void Construction(int A,int B)
// {
// double Construction=0;

// { 
//     Construction=Math.Pow(A,B);
//     Console.WriteLine ($"Число {A} возведено в степень {B} = {Construction} ");
// }
// }





// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// 452 -> 11

// 82 -> 10

// 9012 -> 12


// Console.WriteLine("Введите число: ");
// int num = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine($"Сумма цифр = {sum(num)}");

// int sum(int num)
// {
//     int sum = 0;
//     while (num > 0)
//     {
//         sum += num % 10;
//         num /= 10;
//     }
//     return sum;
// } 




// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]

// 6, 1, 33 -> [6, 1, 33]
